In [1]:
import gspread
import pandas as pd
import os
import sqlalchemy
import requests
import psycopg2
from oauth2client.service_account import ServiceAccountCredentials
from dotenv import load_dotenv
from sqlalchemy import create_engine
from pangres import upsert
from datetime import datetime, timedelta

In [2]:
load_dotenv(".env")

True

In [3]:
DB_HOST = os.getenv("DB_HOST")
DB_USER = os.getenv("DB_USER")
DB_PASSWORD = os.getenv("DB_PASSWORD")
DB_NAME_SOURCE = os.getenv("DB_NAME_SOURCE")
DB_NAME_STG = os.getenv("DB_NAME_STG")
DB_NAME_LOG = os.getenv("DB_NAME_LOG")
DB_SCHEMA_STG = os.getenv("DB_SCHEMA_STG")
DB_SCHEMA_LOG= os.getenv("DB_SCHEMA_LOG")

CRED_PATH = os.getenv("CRED_PATH")
KEY_SPREADSHEET = os.getenv("KEY_SPREADSHEET")
MODEL_PATH = os.getenv("MODEL_PATH")

ACCESS_KEY_MINIO = os.getenv("ACCESS_KEY_MINIO")
SECRET_KEY_MINIO = os.getenv("SECRET_KEY_MINIO")

In [4]:
def read_sql(table_name):
    with open(f"{MODEL_PATH}{table_name}.sql", "r") as file:
        query = file.read()
    return query

In [5]:
from sqlalchemy import create_engine, text
from sqlalchemy.pool import NullPool

#Create variable log engine connectin
_log_engine = None

def get_log_engine():
    # Access variable _log_engine declared in the global scope
    global _log_engine 
    # if _log_engine is None, create the engine
    if _log_engine is None :
        _log_engine = create_engine(
            f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME_LOG}",
            poolclass=NullPool
        )
    return _log_engine

In [6]:
def etl_log(log_msg: dict) :
    try:
        # create connection database
        conn= get_log_engine()
        # conn = create_engine(
        #     f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME_LOG}"
        # )
        # convert dictionary to dataframe
        df_log = pd.DataFrame([log_msg])
        # insert data log to database schema log
        df_log.to_sql(
            name="etl_log",
            con=conn,
            schema="log",
            if_exists="append",
            index=False,
        )
    except Exception as e:
        # import logging
        # logging.error(f"Cant save your log message. Error: {e}", exc_info=True)
        # raise
        print("Can't save your log message. Cause: ", str(e))

In [7]:
query = sqlalchemy.text(read_sql("log"))

In [8]:
print(query.text)

SELECT MAX(etl_date)
FROM log.etl_log
WHERE
    step = :step_name and
    table_name ilike :table_name and
    status = :status and
    process = :process

In [9]:
def read_etl_log(filter_params: dict) :
    try: 
        conn = get_log_engine()
        # conn = create_engine(
        #     f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME_LOG}"
        # )
        query = sqlalchemy.text(read_sql("log"))

        df = pd.read_sql(sql=query, con=conn, params=(filter_params,))
        return df 
    except Exception as e:
        # import logging 
        # logging.error(f"Cant execute your query. Error: {e}", exc_info=True)
        # raise
        print("Can't execute your query. Cause: ", str(e))

In [10]:
def extract_database(table_name: str) :
    try :
        # create connection to database
        # conn = create_engine("postgresql://pacmannweek3:postgres123@localhost:5433/pacmannweek3")
        conn = create_engine(f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME_SOURCE}")

        # create filter log to get etl_date from log table
        filter_log = {
            "step_name":"staging",
            "table_name":table_name,
            "status" : "success",
            "process" : "load"
        }
        etl_date = read_etl_log(filter_log) 

        # check log table, if log table is empty, set etl_date to '1990-01-01' 
        if(etl_date['max'][0] == None):
            etl_date = '1990-01-01'
        else :
            etl_date = etl_date['max'][0]

        # read sql query from model
        query = sqlalchemy.text(read_sql(table_name))

        # execute query using context manager (with statement) to handle open and close connection
        with conn.connect() as connection:
            with conn.begin():
                df = pd.read_sql(sql=query, con=connection, params=({"etl_date":(etl_date)},))
        # df = pd.read_sql(sql=query, con=conn, params=({"etl_date":(etl_date)},))
        log_msg = {
                    "step" : "staging",
                    "process" : "extraction",
                    "status" : "success",
                    "source" : "database",
                    "table_name" : table_name,
                    "etl_date" : datetime.now().strftime("%Y-%m-%d %H:%M:%S")
                }       
        return df

    except Exception as e:
        log_msg = {
            "step" : "staging",
            "process" : "extraction",
            "status" : "failed",
            "source" : "database",
            "table_name" : table_name,
            "etl_date" : datetime.now().strftime("%Y-%m-%d %H:%M:%S"),
            "error_msg" : str(e)
        }
    finally :
        etl_log(log_msg)

In [11]:
def extract_api(link_api:str, list_parameter: dict, data_name) :
    try :
        with requests.Session() as session:
            resp = session.get(link_api, params=list_parameter)
        
        raw_response = resp.json()
        df = pd.DataFrame(raw_response)

        log_msg = {
            "step" : "staging",
                "process":"extraction",
                "status": "success",
                "source": "api",
                "table_name": data_name,
                "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S")
        }
        return df
    
    except Exception as e: 
        print(f"An error occurred while making the API request: {e}")
        log_msg = {
                "step" : "staging",
                "process":"extraction",
                "status": "failed",
                "source": "api",
                "table_name": data_name,
                "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S"),  # Current timestamp
                "error_msg": str(e)
            }
        return pd.DataFrame()
    
    except ValueError as e:
        print(f"An error occurred while parsing the response JSON: {e}")

        # create fail log message
        log_msg = {
                "step" : "staging",
                "process":"extraction",
                "status": "failed",
                "source": "api",
                "table_name": data_name,
                "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S"),  # Current timestamp
                "error_msg": str(e)
            }
        return pd.DataFrame()
    
    finally :
        etl_log(log_msg)

In [12]:
def auth_gspread():
    scope = ['https://spreadsheets.google.com/feeds',
             'https://www.googleapis.com/auth/drive']

    #Define your credentials
    credentials = ServiceAccountCredentials.from_json_keyfile_name(CRED_PATH, scope) # Your json file here

    gc = gspread.authorize(credentials)

    return gc

In [13]:
def init_key_file(key_file:str):
    gc = auth_gspread()
    sheet_result = gc.open_by_key(key_file) 
    return sheet_result

In [14]:
def extract_sheet(key_file: str, worksheet_name: str) -> pd.DataFrame :
    #initialize sheet 
    sheet_result = init_key_file(key_file)

    worksheet_result = sheet_result.worksheet(worksheet_name)

    df_result = pd.DataFrame(worksheet_result.get_all_values())

    #set first rows as columns
    df_result.columns = df_result.iloc[0]

    #get all the rest of the values 
    df_result = df_result[1:].copy()

    return df_result

In [45]:
def extract_spreadsheet(worksheet_name: str, key_file: str) :
    try :
        df_data = extract_sheet(worksheet_name = worksheet_name, key_file=key_file)
        df_data['created_at'] = pd.Timestamp.now()
        
        log_msg = {
                "step" : "staging",
                "process":"extraction",
                "status": "success",
                "source": "spreadsheet",
                "table_name": worksheet_name,
                "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S")  # Current timestamp
        }
    except Exception as e:
        log_msg = {
                "step" : "staging",
                "process":"extraction",
                "status": "failed",
                "source": "spreadsheet",
                "table_name": worksheet_name,
                "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S"),  # Current timestamp
                "error_msg": str(e)
        }
    finally :
        etl_log(log_msg)

    return df_data

In [16]:
from minio import Minio

from io import BytesIO

In [17]:
# helper minio
def handle_error(data, bucket_name:str, table_name:str) :
    current_date = datetime.now().strftime("%Y-%m-%d_%H-%M-%S")
    #initialize minio client 
    client = Minio('localhost:9000', 
                   access_key=ACCESS_KEY_MINIO,
                   secret_key=SECRET_KEY_MINIO,
                   #set secure to False because minio didnt have any encryription
                   secure= False)
    # make a bucket if it doesn't exist
    if not client.bucket_exists(bucket_name):
        client.make_bucket(bucket_name) 

    # convert dataframe to csv and then to bytes 
    csv_bytes = data.to_csv().encode('utf-8')
    csv_buffer = BytesIO(csv_bytes)

    # upload the CSV file to the bucket 
    client.put_object(
        bucket_name = bucket_name,
        object_name = f"{table_name}_{current_date}.csv",
        data=csv_buffer,
        length=len(csv_bytes), 
    )

    # list objects in the bucket 
    objects = client.list_objects(bucket_name, recursive = True)
    for obj in objects :
        print(obj.object_name)

In [ ]:
def load_staging(data, schema:str,  table_name:str, idx_name: str, source) :
    try :
        #create connection to database
        conn = create_engine(f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME_STG}")

        # set data index or primary key
        data = data.set_index(idx_name)

        # do upsert (update for data existing and insert for new data)
        # with conn.connect() as connection:
        #     with connection.begin():
        #         upsert(
        #             con=connection,
        #             df=data,
        #             table_name = table_name,
        #             schema= schema,
        #             if_row_exists = "update"
        #         )
        upsert(
            con=conn,
            df=data,
            table_name = table_name,
            schema= schema,
            if_row_exists = "update"
        )

        #create success log message
        log_msg = {
             "step" : "staging",
                "process":"load",
                "status": "success",
                "source": source,
                "table_name": table_name,
                "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S")  # Current timestamp
        }

    except Exception as e:
         #create fail log message
        log_msg = {
            "step" : "staging",
            "process":"load",
            "status": "failed",
            "source": source,
            "table_name": table_name,
            "etl_date": datetime.now().strftime("%Y-%m-%d %H:%M:%S") , # Current timestamp
            "error_msg": str(e)
        }
        # Handling error: save data to Object Storage
        try:
            handle_error(data = data, bucket_name='error-dellstore', table_name= table_name)
        except Exception as e:
            # best practices: save exception to file or log
            print(e)
    finally:
        etl_log(log_msg)

In [19]:
# extract from database 
df_customer = extract_database(table_name="customers")

In [20]:
df_customer

,customerid,firstname,lastname,address1,address2,city,state,zip,country,region,...,phone,creditcardtype,creditcard,creditcardexpiration,username,password,age,income,gender,created_at
0,11,Becky,Cochran,"193 Hailey Views\nMichaelside, AS 48241",None,East Charleneshire,Pennsylvania,53868,US,1,...,2415449050,5,6630987872369588,2010/03,beckycochran123,password,58,60000,M,2002-03-01
1,12,Raymond,Yang,"683 Albert Ports\nLake Waltershire, CO 77913",None,Laneberg,Pennsylvania,18452,US,1,...,1896033667,2,3715867913328111,2011/10,raymondyang123,password,27,20000,F,2003-10-01
2,13,Melanie,Wade,"514 Tonya Heights Suite 730\nSouth Davidfurt, ...",None,Port Jessica,Delaware,53356,US,1,...,3029418206,5,3617457962129265,2009/11,melaniewade123,password,43,100000,M,2001-11-01
3,14,Heather,Cruz,"75935 Flynn Island Suite 933\nSouth Alexis, MD...",None,Maryton,North Dakota,44395,US,1,...,3748672054,4,3344003576319665,2011/07,heathercruz123,password,85,80000,M,2003-07-01
4,15,Heather,Burgess,6732 Brandi Trafficway Suite 104\nNorth Jonath...,None,South Ryan,New Hampshire,37471,US,1,...,3354132892,4,8717996907886119,2008/05,heatherburgess123,password,66,100000,M,2000-05-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19996,19995,Marc,Gilbert,"7502 Wilkins Knolls Suite 109\nSouth Deanna, K...",None,Proctorton,Texas,0,UK,2,...,6088190939,1,7026820751838387,2011/08,marcgilbert123,password,20,100000,M,2003-08-01
19997,19996,Sandra,Ochoa,"45384 James View Apt. 503\nNew David, PA 63231",None,Stevenshire,South Dakota,0,Chile,2,...,5392978326,5,9188167935237288,2008/11,sandraochoa123,password,78,60000,F,2000-11-01
19998,19997,Kendra,Bradley,"4370 Tammy Turnpike\nStewartstad, OK 25433",None,Vanessaville,Ohio,0,Australia,2,...,3311555452,4,2423516578041017,2008/06,kendrabradley123,password,73,60000,M,2000-06-01
19999,19998,Robert,Webb,"02659 Benjamin Mill Suite 976\nMichellefurt, M...",None,East Johnville,Nebraska,0,Russia,2,...,7635641998,5,8653337796218694,2009/08,robertwebb123,password,36,100000,F,2001-08-01
20000,19999,Lauren,Stanley,225 Robinson Club Suite 388\nSouth Staceychest...,None,Port Christina,Connecticut,0,UK,2,...,5488070628,4,2519272508565336,2008/12,laurenstanley123,password,28,20000,M,2000-12-01

In [21]:
load_staging(data = df_customer.iloc[:, :-1], schema="staging",
             table_name="customers", idx_name="customerid",
             source="database")

In [22]:
df_categories = extract_database(table_name="categories")
df_categories.head()

   category categoryname created_at
0         1       Action 2004-03-01
1         2    Animation 2004-03-01
2         3     Children 2004-03-01
3         4     Classics 2004-03-01
4         5       Comedy 2004-03-01

In [23]:
load_staging(data = df_categories.iloc[:, :-1], schema="staging",
             table_name="categories", idx_name="category",
             source="database")

In [24]:
df_products = extract_database(table_name = "products")
df_products.head()

,prod_id,category,title,actor,price,special,common_prod_id,created_at
0,1,14,ACADEMY ACADEMY,PENELOPE GUINESS,25.99,0,1976,2004-03-01
1,2,6,ACADEMY ACE,EWAN RICKMAN,20.99,0,6289,2004-03-01
2,3,6,ACADEMY ADAPTATION,VIVIEN KAHN,28.99,0,7173,2004-03-01
3,4,3,ACADEMY AFFAIR,ALAN MARX,14.99,0,8042,2004-03-01
4,5,3,ACADEMY AFRICAN,CARRIE HANNAH,11.99,1,2183,2004-03-01

In [25]:
load_staging(data = df_products.iloc[:, :-1], schema="staging",
                table_name="products", idx_name="prod_id",
                source="database")

In [26]:
df_inventory = extract_database(table_name="inventory")
df_inventory.head()

   prod_id  quan_in_stock  sales created_at
0        1            138      9 2004-03-01
1        2            118     19 2004-03-01
2        3            228     11 2004-03-01
3        4            279     12 2004-03-01
4        5            382     13 2004-03-01

In [27]:
load_staging(data=df_inventory.iloc[:, :-1], schema="staging",
             table_name="inventory", idx_name="prod_id",
             source="database")

In [28]:
df_orders = extract_database(table_name="orders")
df_orders.head()

   orderid   orderdate  customerid  netamount    tax  totalamount created_at
0     2001  2004-03-04         931      31.84   2.63        34.47 2004-03-04
1     2002  2004-03-22       14397     357.33  29.48       386.81 2004-03-22
2     2003  2004-03-13         409     172.38  14.22       186.60 2004-03-13
3     2004  2004-03-19       14315     284.06  23.43       307.49 2004-03-19
4     2005  2004-03-14       14589     245.50  20.25       265.75 2004-03-14

In [29]:
load_staging(data = df_orders.iloc[:, :-1], schema="staging",
             table_name="orders", idx_name="orderid",   
             source="database")

In [30]:
df_orderlines = extract_database(table_name = "orderlines")
df_orderlines.head()

   orderlineid  orderid  prod_id  quantity   orderdate created_at
0            1     2001     9702         3  2004-03-04 2004-03-04
1            2     2001     3782         3  2004-03-04 2004-03-04
2            3     2001     2714         2  2004-03-04 2004-03-04
3            4     2001     4178         3  2004-03-04 2004-03-04
4            5     2001        4         2  2004-03-04 2004-03-04

In [31]:
load_staging(data = df_orderlines.iloc[:, :-1], schema="staging",
             table_name="orderlines", idx_name=["orderid","orderlineid"],
             source="database")

In [32]:
df_cust_hist = extract_database(table_name = "cust_hist")
df_cust_hist.head()

   customerid  orderid  prod_id created_at
0        7888        1     9117 2004-01-27
1        7888        1     3353 2004-01-27
2        7888        1     2778 2004-01-27
3        7888        1     4774 2004-01-27
4        7888        1     3648 2004-01-27

In [33]:
load_staging(data = df_cust_hist.iloc[:, :-1], schema="staging",
             table_name="cust_hist", idx_name=['customerid','orderid','prod_id'],
             source="database")

In [34]:
# create function for generate list of date for data from API
def date_range(start_date, end_date):
    delta = end_date - start_date 
    return [(start_date + timedelta(days=i)).strftime("%Y-%m-%d") for i in range(delta.days + 1)]

In [35]:
# Define the date range
start_date = datetime.strptime("2004-01-01", "%Y-%m-%d")
end_date = datetime.strptime("2004-02-29", "%Y-%m-%d")

# Generate list of dates
dates = date_range(start_date, end_date)

In [38]:
link_api = "https://api-history-order.vercel.app/api/dummydata"

for date in dates :
    list_parameter = {
        "start_date": date,
        "end_date" : date,
    }

    #  extract data 
    df_backfilling = extract_api(link_api = link_api,
                                 list_parameter=list_parameter,
                                 data_name="customer_orders_history")
    if(not df_backfilling.empty) :
        load_staging(data = df_backfilling,
                     schema="staging",
                     table_name = "customer_orders_history",
                     idx_name=['customer_id','order_id','orderline_id'],
                     source="api")

In [46]:
# ingestion data spreadsheet 
df_analytic = extract_spreadsheet(worksheet_name = "dellstore_analytic",
                                  key_file = KEY_SPREADSHEET)

In [47]:
df_analytic.head()

0 orderid sum_stock       status                 created_at
1    6114         0    fulfilled 2026-01-19 20:35:14.297783
2   11233       100  backordered 2026-01-19 20:35:14.297783
3    4790         0    fulfilled 2026-01-19 20:35:14.297783
4     273         0    fulfilled 2026-01-19 20:35:14.297783
5   11719         0    fulfilled 2026-01-19 20:35:14.297783

In [48]:
load_staging(data = df_analytic, schema="staging",
             table_name = "order_status_analytic", idx_name="orderid",
             source="spreadsheet")